[
  {
    "title": "Added graph for full dividend history",
    "date": "July 12, 2023",
    "description": "I've added a new chart to take advantage of the availability of full dividend history records. The first chart on the stock page is now a full dividend history, followed by the collection of charts that represent the stock records (overlapping data with more information)."
  },
  {
    "title": "Splitting records into two categories",
    "date": "July 11, 2023",
    "description": "While stocks tend to have many dividend payout records, they often have far fewer records that include other stock information, such as the stock value at the given time, or trade volume. Before, to account for this, I was filtering out records that didn't include all data. However, this meant getting rid of useful dividend price data. To address this, I've created two different record values to guide users in the hopes of providing as much information as possible. I'll be adding full dividend record charts soon."
  },
  {
    "title": "Increased chart sizes to encompass all records for the respective stock",
    "date": "July 11, 2023",
    "description": "I've modified the charts so that the respective stock's full history is visibile. Priorly, the charts cut off after 48 results. To achieve this, I've truncated the data fed to the graph, so that for charts with > 48 data points, they skip data points at even intervals to create a lower resolution (but accurate) full representation. If you think there's a better way, send me a message at <a href='mailto:support@coastlightdigital.com'>support@coastlightdigital.com</a>"
  },
  {
    "title": "Added year display to the record column on tables",
    "date": "July 11, 2023",
    "description": "To assist in interpretting the recorded payout column on tables, I've added a year value, which translates the number of records in to years."
  },
  {
    "title": "Added stock type filters to search table",
    "date": "July 11, 2023",
    "description": "Database queries are now filterable by stock type. Use the multi-select in the filters section on the homepage to apply the new feature."
  },
  {
    "title": "Added stock type to DB and stock pages",
    "date": "July 10, 2023",
    "description": "Added a stock type field to the db, which indicates whether a stock is an ETF, ETS, Common stock, and more. This value has been added to the individual stock pages for now. A filter will be added to search for specific stock types soon."
  },
  {
    "title": "Added announcements",
    "date": "July 10, 2023",
    "description": "Added an announcements pane to notify users of new features and changes."
  },
  {
    "title": "Added changelog page",
    "date": "July 10, 2023",
    "description": "See title."
  },
  {
    "title": "Full stock titles",
    "date": "July 9, 2023",
    "description": "Added expanded (full) stock titles to tables"
  }
]